In [8]:
# 누락 데이터처리
# 누락 데이터확인
# count()
# value_counts
import seaborn as sns

In [9]:
# deck 컬럼의 값들의 개수 : value_counts()
df = sns.load_dataset('titanic')
df['deck'].value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [10]:

df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
# isnull() : 누락 데이터 개수 확인
print(df.head().isnull().sum(axis=0))
print(df.isnull().sum(axis=0))

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           3
embark_town    0
alive          0
alone          0
dtype: int64
survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [12]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [13]:
df_1 = df.dropna(axis=1, thresh=500)
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [15]:
df_2 = df.dropna(subset=['age'], how='any', axis=0)
print(len(df_2))

714

In [16]:
print(df['age'].head(10))

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [ ]:
df.columns =  ['mpg','cylinders','displacement','horsepower','weight',
             'acceleration','model year','origin','name']

In [1]:
# 중복데이터 처리
# 중복데이터를 갖는 데이터 프레임 만들기
import pandas as pd

df = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                  'c2':[1, 1, 1, 2, 2],
                  'c3':[1, 1, 2, 2, 2]})
df.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [2]:
# 'c2' 컬럼에 대해서 중복 체크
col_dup=df['c2'].duplicated()
col_dup

0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool

In [3]:
# 중복 데이터 제거하는 함수 : drop_duplicates()
df2 = df.drop_duplicates()
df2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [4]:
# 중복 데이터 제거하는 함수 : drop_duplicates()
df2 = df.drop_duplicates(subset=['c2','c3'])
df2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

In [5]:
df2 = df.drop_duplicates(subset=['c1'])
df2

  c1  c2  c3
0  a   1   1
2  b   1   2

In [ ]:
# 데이터 정제
# 1. 누락 데이터 처리 -> Nan, 특수문자
#      dropna(subset=[ ] , thresh, axis=0, inplace=True, 
#      fillna(값, method='ffill' or 'bfill'))
# 2. 중복 데이터 처리
#      drop_duplicates(subset=[ ] )
# 3. 데이터 표준화
#      -1 : 단위 환산
#      -2 : 자료형 변환
# 4. 범주형 데이터 처리 : 카테고리 형으로 변환
#            구간으로 데이터 처리를 나누어서 처리
# 5. 더미변수 : 카테고리가 데이터인 경우0과 1으로 겂울 변환시킴
# 6. train과 test분리 -> 모델학습

In [ ]:
# 단위확산
df = pd.read_csv('./dataset/auto-mpg.csv', header=None)

df.columns = df.columns =  ['mpg','cylinders','displacement','horsepower','weight',
             'acceleration','model year','origin','name']

df.head(3)

In [6]:
# 문자 또는 숫자를 카테고리 형으로 변경
# 원핫 인코딩을 통해서 자료 변형
# 연속형 자료를 범주형으로 변경
# 1. horsepower 컬럼을 3구간으로 나누어서 범주혐으로 나눔
# 2. 각 구간별 경계선의 값이 필요함 : np.histogram(컬럼명, bins=구간수)
#     각 구간별 경계값과 구간에 소속된 데이터 갯수를 리스트로 튜플로 반환
import numpy as np
np.histogram(df['horsepower'], bins = 3)

df['horsepower'].isnull().values_counts()

KeyError: 'horsepower'